src/DataProcessors/УА_ПолучитьИндекс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>УА_ПолучитьИндекс</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/УА_ЦеныИнструментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>УА_ЦеныИнструментов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Инструмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УА_БиржевыеИнструменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/УА_Портфели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>УА_Портфели</Name>
			<Comment>Произвольный набор активов пользователя</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Инструмент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УА_БиржевыеИнструменты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/УА_Индексы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>УА_Индексы</Name>
			<Comment>Биржевые индексы с составом входящих активов</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УА_ТипыИндексов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Инструмент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УА_БиржевыеИнструменты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/УА_ПолучитьИндекс/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Портфель = Справочники.УА_Портфели.ПортфельПоУмолчанию();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция _ДополнитьЦенами(ТаблицаИндексПортфель, ТаблицаЦен)
	
	Результат = УА_ОбщегоНазначения.ОписаниеРезультата(); // Используем стандартный объект результата

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаИндексПортфель", ТаблицаИндексПортфель);
	Запрос.УстановитьПараметр("ТаблицаЦен", ТаблицаЦен);
	Запрос.Текст = "ВЫБРАТЬ
	|	тИП.Инструмент КАК Инструмент,
	|	тИП.Вес КАК Вес,
	|	тИП.Количество КАК Количество
	|ПОМЕСТИТЬ врИП
	|ИЗ
	|	&ТаблицаИндексПортфель КАК тИП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тЦ.Инструмент КАК Инструмент,
	|	тЦ.Цена КАК Цена
	|ПОМЕСТИТЬ врЦ
	|ИЗ
	|	&ТаблицаЦен КАК тЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	врИП.Инструмент КАК Инструмент,
	|	врЦ.Цена КАК Цена,
	|	ЕСТЬNULL(врИП.Количество, 0) КАК Количество,
	|	ЕСТЬNULL(врЦ.Цена, 0) * ЕСТЬNULL(врИП.Количество, 0) КАК Сумма,
	|	ЕСТЬNULL(врИП.Вес, 0) КАК ВесВИндексе,
	|	0 КАК ВесВПортфеле
	|ИЗ
	|	врИП КАК врИП
	|		ЛЕВОЕ СОЕДИНЕНИЕ врЦ КАК врЦ
	|		ПО врИП.Инструмент = врЦ.Инструмент";
	Попытка
		ТаблицаСЦенами = Запрос.Выполнить().Выгрузить();
		Результат.Данные = ТаблицаСЦенами;
	Исключение
		Результат.ПроизошлаОшибка = Истина;
		Результат.ТекстОшибки = "Ошибка при выполнении запроса для дополнения ценами: " + ОписаниеОшибки();
	КонецПопытки;

	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция _ТаблицаЦен(Инструменты)
	
	Результат = УА_ОбщегоНазначения.ОписаниеРезультата();

	ЗапросЦен = Новый Запрос;
	ЗапросЦен.УстановитьПараметр("Инструменты", Инструменты);
	
	ЗапросЦен.Текст = "ВЫБРАТЬ
	|	УА_ЦеныИнструментовСрезПоследних.Инструмент КАК Инструмент,
	|	УА_ЦеныИнструментовСрезПоследних.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.УА_ЦеныИнструментов.СрезПоследних КАК УА_ЦеныИнструментовСрезПоследних
	|ГДЕ
	|	УА_ЦеныИнструментовСрезПоследних.Инструмент В(&Инструменты)";
	
	ТаблицаЦен = ЗапросЦен.Выполнить().Выгрузить();

	Результат.Данные = ТаблицаЦен;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция _ТаблицаИндексПортфель()
	
	Результат = УА_ОбщегоНазначения.ОписаниеРезультата();

	РезультатТаблицыИндекса = _ТаблицаПозицийИндекса(Индекс);
	
	Если РезультатТаблицыИндекса.ПроизошлаОшибка Тогда
		Возврат РезультатТаблицыИндекса;
	КонецЕсли;
	
	ТаблицаИндекса = РезультатТаблицыИндекса.Данные;
	ТаблицаИндекса.Сортировать("Вес Убыв");

	РезультатТаблицыПортфеля = _ТаблицаДанныхПортфеля(Портфель);
	
	Если РезультатТаблицыПортфеля.ПроизошлаОшибка Тогда
		Возврат РезультатТаблицыПортфеля; // Передаем ошибку выше
	КонецЕсли;
	ТаблицаПортфеля = РезультатТаблицыПортфеля.Данные;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаИндекса",  ТаблицаИндекса);
	Запрос.УстановитьПараметр("ТаблицаПортфеля", ТаблицаПортфеля);
	Запрос.Текст = "ВЫБРАТЬ
	|	ТИ.Инструмент КАК Инструмент,
	|	ТИ.Вес КАК Вес
	|ПОМЕСТИТЬ врИ
	|ИЗ
	|	&ТаблицаИндекса КАК ТИ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТП.Инструмент КАК Инструмент,
	|	ТП.Количество КАК Количество
	|ПОМЕСТИТЬ врП
	|ИЗ
	|	&ТаблицаПортфеля КАК ТП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(вИ.Инструмент, вП.Инструмент) КАК Инструмент,
	|	ЕСТЬNULL(вИ.Вес, 0) КАК Вес,
	|	ЕСТЬNULL(вП.Количество, 0) КАК Количество
	|ИЗ
	|	врИ КАК вИ
	|		ПОЛНОЕ СОЕДИНЕНИЕ врП КАК вП
	|		ПО вИ.Инструмент = вП.Инструмент";
	Попытка
		РезультирующаяТаблица = Запрос.Выполнить().Выгрузить();
		Результат.Данные = РезультирующаяТаблица;
	Исключение
		Результат.ПроизошлаОшибка = Истина;
		Результат.ТекстОшибки = "Ошибка при выполнении запроса для объединения данных индекса и портфеля: " + ОписаниеОшибки();
	КонецПопытки;

	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция _ТаблицаДанныхПортфеля(Портфель)
	
	Результат = УА_ОбщегоНазначения.ОписаниеРезультата();

	ЗапросДанных = Новый Запрос;
	ЗапросДанных.УстановитьПараметр("Портфель", Портфель);
	
	ЗапросДанных.Текст = "ВЫБРАТЬ
	|	УА_ПортфелиСостав.Инструмент КАК Инструмент,
	|	УА_ПортфелиСостав.Количество КАК Количество
	|ИЗ
	|	Справочник.УА_Портфели.Состав КАК УА_ПортфелиСостав
	|ГДЕ
	|	УА_ПортфелиСостав.Ссылка = &Портфель";

	ТаблицаПортфеля = ЗапросДанных.Выполнить().Выгрузить();
	
	Результат.Данные = ТаблицаПортфеля;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция _ТаблицаПозицийИндекса(Индекс)
	
	Результат = УА_ОбщегоНазначения.ОписаниеРезультата();

	Если НЕ ЗначениеЗаполнено(Индекс) Тогда
		Результат.ПроизошлаОшибка = Истина;
		Результат.ТекстОшибки = "Не указан индекс для получения позиций";
		Возврат Результат;
	КонецЕсли;

	Попытка
		ЗапросПозиций = Новый Запрос;
		ЗапросПозиций.УстановитьПараметр("Индекс", Индекс);
		
		ЗапросПозиций.Текст = "ВЫБРАТЬ
		|	УА_ИндексыСостав.Инструмент КАК Инструмент,
		|	УА_ИндексыСостав.Вес КАК Вес
		|ИЗ
		|	Справочник.УА_Индексы.Состав КАК УА_ИндексыСостав
		|ГДЕ
		|	УА_ИндексыСостав.Ссылка = &Индекс
		|	И НЕ УА_ИндексыСостав.Инструмент.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	УА_ИндексыСостав.Вес УБЫВ";
		
		ТаблицаПозиций = ЗапросПозиций.Выполнить().Выгрузить();
		
		Результат.Данные = ТаблицаПозиций;
		
	Исключение
		Результат.ПроизошлаОшибка = Истина;
		Результат.ТекстОшибки = "Ошибка при получении позиций индекса: " + ОписаниеОшибки();
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПолучитьИндекс(Команда)
	ПолучитьИндексНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьИндексНаСервере()

	РезультатТаблицыИндексПортфель = _ТаблицаИндексПортфель();
	Если РезультатТаблицыИндексПортфель.ПроизошлаОшибка Тогда
		Сообщить("Ошибка при получении данных портфеля: " + РезультатТаблицыИндексПортфель.ТекстОшибки);
		Возврат;
	КонецЕсли;
	ТаблицаИндексПортфель = РезультатТаблицыИндексПортфель.Данные;
	Если ТаблицаИндексПортфель.Количество() = 0 Тогда
		Сообщить("В портфеле нет позиций для обработки.");
		Возврат;
	КонецЕсли;

	Инструменты = ТаблицаИндексПортфель.ВыгрузитьКолонку("Инструмент");
	
	РезультатТаблицыЦен = _ТаблицаЦен(Инструменты);
	Если РезультатТаблицыЦен.ПроизошлаОшибка Тогда
		Сообщить("Ошибка при получении цен акций: " + РезультатТаблицыЦен.ТекстОшибки);
		Возврат;
	КонецЕсли;
	ТаблицаЦен = РезультатТаблицыЦен.Данные;

	РезультатТаблицыСЦенами = _ДополнитьЦенами(ТаблицаИндексПортфель, ТаблицаЦен);
	Если РезультатТаблицыСЦенами.ПроизошлаОшибка Тогда
		Сообщить("Ошибка при дополнении данных ценами: " + РезультатТаблицыСЦенами.ТекстОшибки);
		Возврат;
	КонецЕсли;
	ТаблицаСЦенами = РезультатТаблицыСЦенами.Данные;

	СуммаПортфеляАкций = ТаблицаСЦенами.Итог("Сумма");

	Для Каждого СтрокаТаблицы Из ТаблицаСЦенами Цикл
		
		Если СуммаПортфеляАкций <> 0 Тогда
			СтрокаТаблицы.ВесВПортфеле = (СтрокаТаблицы.Сумма / СуммаПортфеляАкций) * 100;
		Иначе
			СтрокаТаблицы.ВесВПортфеле = 0;
		КонецЕсли;
		
	КонецЦикла;

	ИтоговаяТаблица.Загрузить(ТаблицаСЦенами);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦеныНаСервере()
	РегистрыСведений.УА_ЦеныИнструментов.ЗаполнитьЦены();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦены(Команда)
	ЗаполнитьЦеныНаСервере();
КонецПроцедуры

#КонецОбласти
